src/Catalogs/ИнформационныеБазы/ИнформационныеБазы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ИнформационныеБазы</name>
  <hierarchical>true</hierarchical>
  <owners>Catalog.Кластеры</owners>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидХраненияАккаунта</name>
    <type>
      <types>EnumRef.ВидыХраненияАккаунтов</types>
    </type>
  </attributes>
  <attributes>
    <name>Логин</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Аккаунт</name>
    <type>
      <types>CatalogRef.Аккаунты</types>
    </type>
  </attributes>
  <attributes>
    <name>Скрыть</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/Enums/ВидыХраненияАккаунтов/ВидыХраненияАккаунтов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыХраненияАккаунтов</name>
  <enumValues>
    <name>ЛогинПароль</name>
  </enumValues>
  <enumValues>
    <name>ОбщийАккаунт</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/ИнформационныеБазы/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если НЕ ЗначениеЗаполнено(Объект.ВидХраненияАккаунта) Тогда
		Объект.ВидХраненияАккаунта = Перечисления.ВидыХраненияАккаунтов.ЛогинПароль;
	КонецЕсли;

	ПарольВХранилище = ОбщегоНазначенияСтраж.ПолучитьПароль(Объект.Ссылка);
	Пароль = ?(ЗначениеЗаполнено(ПарольВХранилище), УникальныйИдентификатор, "");
	
	ОбновитьВидимостьИДоступность();
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ОбщегоНазначенияСтраж.ОбработатьПарольФормыПриЗаписи(ТекущийОбъект.Ссылка, ПарольИзменен, Пароль);
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура ВидХраненияАккаунтаПриИзменении(Элемент)
	ОбновитьВидимостьИДоступность();
КонецПроцедуры

&НаКлиенте
Процедура ПарольПриИзменении(Элемент)
	ПарольИзменен = Истина;
КонецПроцедуры
#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьВидимостьИДоступность()
	Элементы.Аккаунт.Доступность = (Объект.ВидХраненияАккаунта = Перечисления.ВидыХраненияАккаунтов.ОбщийАккаунт);
	Элементы.Логин.Доступность = (Объект.ВидХраненияАккаунта = Перечисления.ВидыХраненияАккаунтов.ЛогинПароль);
	Элементы.Пароль.Доступность = (Объект.ВидХраненияАккаунта = Перечисления.ВидыХраненияАккаунтов.ЛогинПароль);
КонецПроцедуры

#КонецОбласти
